{
  "applications": [
    {
      "slug": "ruyax",
      "is_placeholder": false,
      "href": "app.html?slug=ruyax",
      "imgSrc": "https://raw.githubusercontent.com/AssylEr/MedEr/main/Screenshot1.jpg",
      "alt": "RuyaX App Preview",
      "en": {
        "name": "RuyaX",
        "short_desc": "An immersive, full-screen world of short-form videos and stunning images. RuyaX is a next-generation social platform designed for visual storytelling and global connection.",
        "page_title": "RuyaX - Your Vision, Your World",
        "header_title": "RuyaX",
        "header_subtitle": "Your Vision, Your World",
        "intro_title": "Experience a Universe of Creativity",
        "intro_desc": "Dive into an immersive, full-screen world of short-form videos and stunning images. RuyaX is a next-generation social platform designed for visual storytelling, connecting you with a global community of creators and dreamers.",
        "features_title": "Unleash Your Creativity with Powerful Tools",
        "features_desc": "RuyaX empowers you to share your moments and express your unique vision. With our advanced, yet easy-to-use creation tools, your next masterpiece is just a tap away.",
        "features_list": [
          {
            "item": "<strong>Advanced In-App Camera:</strong> Switch between photo and video mode, use front or back cameras, control flash, and even apply live filters to capture the perfect shot."
          },
          {
            "item": "<strong>Perfect Your Frame:</strong> Choose from multiple aspect ratios (9:16, 16:9, 1:1) to ensure your content looks exactly how you envisioned it."
          },
          {
            "item": "<strong>Engage & Connect:</strong> Follow your favorite creators, engage with posts through likes and comments, and have private, secure conversations with friends, complete with media and audio message sharing."
          }
        ],
        "gallery_title": "A Glimpse Inside RuyaX",
        "gallery_desc": "Here are some snapshots of the RuyaX experience. See how our community brings creativity to life!",
        "howto_title": "How to Get Started",
        "howto_desc": "Joining the RuyaX community is simple. Follow these easy steps to begin your journey:",
        "howto_steps": [
          {
            "item": "<strong>Step 1: Sign Up Securely</strong><br>Create an account in seconds using your email or Google account. We prioritize your security from the very first step."
          },
          {
            "item": "<strong>Step 2: Discover & Explore</strong><br>Swipe through a personalized, full-screen feed of content. The more you watch and interact, the better our recommendations become. Use the search feature to find new creators and trends."
          },
          {
            "item": "<strong>Step 3: Create & Share</strong><br>Tap the upload button to share from your gallery, or use our in-app camera to capture a new moment. Add a title and description, and share it with the world!"
          }
        ],
        "privacy_title": "Your Privacy, Your Control",
        "privacy_desc": "We believe in being upfront and clear about how we handle your data. Your trust is our top priority.",
        "privacy_points": [
          {
            "item": "<strong>You Are in Control:</strong> We only require your email for account creation. You decide what other information to share on your profile, with privacy settings to control the visibility of your age, gender, and country."
          },
          {
            "item": "<strong>A Safe Community:</strong> We provide tools to ensure your safety. Block users you don't want to interact with and report any content that violates our guidelines."
          },
          {
            "item": "<strong>Data Deletion:</strong> You have the right to request the complete deletion of your account and all associated data directly within the app."
          }
        ],
        "privacy_summary": "This is a summary. For complete details, we encourage you to read our full Privacy Policy.",
        "privacy_btn_text": "View Full Privacy Policy",
        "footer_title": "Ready to Join the Vision?",
        "footer_desc": "Download RuyaX today and start your creative journey. We can't wait to see what you'll create!",
        "download_btn_text": "Get RuyaX for Free",
        "privacy_page_title": "Privacy Policy - RuyaX App",
        "privacy_header_title": "RuyaX App Privacy Policy",
        "privacy_header_subtitle": "Last Updated: October 16, 2025",
        "privacy_content": "### Introduction\n\nThis Privacy Policy applies specifically to the RuyaX mobile application (\"the App\"). It explains how we collect, use, and protect your information when you use our App. For information regarding our website, please see our [Website Privacy Policy](privacy.html).\n\n### Information We Collect\n\n#### Information You Provide to Us\n*   **Account Information:** When you create a RuyaX account, you provide us with information such as your email address, username, and password. You may also choose to add more information to your profile, like a profile picture, biography, age, gender, and country.\n*   **Content:** We collect the content you create on the App, including photos and videos you upload, comments you post, and metadata associated with this content.\n*   **Communications:** We collect information when you communicate with us (e.g., for customer support) or with others through the App's messaging features, including the content of messages, media, and audio notes.\n\n#### Information We Collect Automatically\n*   **Usage Information:** We collect information about your activity on the App, such as which videos you watch, creators you follow, and how you interact with content and features.\n*   **Device Information:** We collect information from and about the devices you use, such as your IP address, device type, operating system, and unique device identifiers.\n\n#### Permissions\n*   **Camera and Photos/Videos:** We require access to your camera and photo/video library so you can create and upload visual content, which is a core feature of the App.\n*   **Microphone:** We require access to your microphone to allow you to record audio for your videos and send voice messages in chats.\n\n### How We Use Your Information\n\nWe use your information to:\n\n*   Provide, maintain, and improve the App and its features.\n*   Personalize your experience by showing you content we think you'll be interested in.\n*   Allow you to connect and communicate with other users.\n*   Communicate with you, including for technical support and service-related announcements.\n*   Enforce our terms, conditions, and policies to ensure the safety and security of our community.\n\n### How We Share Your Information\n\nWe may share your information in the following situations:\n\n*   **With Other Users:** Your profile information (username, profile picture) and the content you post are visible to other users. How widely your content is shared depends on your audience settings.\n*   **For Legal Reasons:** We may share information if we believe it's required by law or to protect the rights, property, or safety of RuyaX, our users, or others.\n\n### Your Choices and Control\n\nYou have control over your information. Within the App, you can:\n\n*   Access and update your profile information at any time.\n*   Control who can see your content.\n*   Delete your account permanently through the settings menu, which will also delete your data.\n*   Block other users and report content that violates our policies.\n\n### Contact Us\n\nIf you have questions about this App Privacy Policy, please contact us at: <a href='mailto:contact@ruyax.dev'>contact@ruyax.dev</a>"
      },
      "ar": {
        "name": "RuyaX",
        "short_desc": "عالم غامر بملء الشاشة من مقاطع الفيديو القصيرة والصور المذهلة. RuyaX هي منصة اجتماعية من الجيل التالي مصممة لسرد القصص المرئية والتواصل العالمي.",
        "page_title": "RuyaX - رؤيتك، عالمك",
        "header_title": "RuyaX",
        "header_subtitle": "رؤيتك، عالمك",
        "intro_title": "اكتشف عالمًا من الإبداع",
        "intro_desc": "انغمس في عالم غامر بملء الشاشة من مقاطع الفيديو القصيرة والصور المذهلة. RuyaX هي منصة اجتماعية من الجيل التالي مصممة لسرد القصص المرئية، وتربطك بمجتمع عالمي من المبدعين والحالمين.",
        "features_title": "أطلق العنان لإبداعك بأدوات قوية",
        "features_desc": "يمكّنك RuyaX من مشاركة لحظاتك والتعبير عن رؤيتك الفريدة. مع أدواتنا المتقدمة وسهلة الاستخدام، فإن تحفتك الفنية التالية على بعد نقرة واحدة.",
        "features_list": [
          {
            "item": "<strong>كاميرا متقدمة داخل التطبيق:</strong> بدّل بين وضع الصور والفيديو، استخدم الكاميرا الأمامية أو الخلفية، تحكم في الفلاش، وطبّق فلاتر حية لالتقاط اللقطة المثالية."
          },
          {
            "item": "<strong>إطار مثالي:</strong> اختر من بين نسب عرض إلى ارتفاع متعددة (9:16، 16:9، 1:1) لضمان ظهور المحتوى الخاص بك تمامًا كما تخيلته."
          },
          {
            "item": "<strong>تفاعل وتواصل:</strong> تابع المبدعين المفضلين لديك، تفاعل مع المنشورات عبر الإعجابات والتعليقات، وأجرِ محادثات خاصة وآمنة مع الأصدقاء، مع إمكانية مشاركة الوسائط والرسائل الصوتية."
          }
        ],
        "gallery_title": "لمحة داخل RuyaX",
        "gallery_desc": "إليك بعض اللقطات من تجربة RuyaX. شاهد كيف يبدع مجتمعنا!",
        "howto_title": "كيف تبدأ",
        "howto_desc": "الانضمام إلى مجتمع RuyaX بسيط. اتبع هذه الخطوات السهلة لبدء رحلتك:",
        "howto_steps": [
          {
            "item": "<strong>الخطوة 1: تسجيل آمن</strong><br>أنشئ حسابًا في ثوانٍ باستخدام بريدك الإلكتروني أو حساب Google. نحن نعطي الأولوية لأمنك منذ الخطوة الأولى."
          },
          {
            "item": "<strong>الخطوة 2: اكتشف واستكشف</strong><br>تصفح موجزًا مخصصًا بملء الشاشة. كلما شاهدت وتفاعلت أكثر، أصبحت توصياتنا أفضل. استخدم ميزة البحث للعثور على مبدعين واتجاهات جديدة."
          },
          {
            "item": "<strong>الخطوة 3: أنشئ وشارك</strong><br>انقر على زر التحميل للمشاركة من معرض الصور الخاص بك، أو استخدم الكاميرا داخل التطبيق لالتقاط لحظة جديدة. أضف عنوانًا ووصفًا، وشاركه مع العالم!"
          }
        ],
        "privacy_title": "خصوصيتك تحت سيطرتك",
        "privacy_desc": "نؤمن بالشفافية والوضوح في كيفية تعاملنا مع بياناتك. ثقتك هي أولويتنا القصوى.",
        "privacy_points": [
          {
            "item": "<strong>أنت المتحكم:</strong> نطلب فقط بريدك الإلكتروني لإنشاء الحساب. أنت تقرر المعلومات الأخرى التي تشاركها في ملفك الشخصي، مع إعدادات الخصوصية للتحكم في رؤية عمرك وجنسك وبلدك."
          },
          {
            "item": "<strong>مجتمع آمن:</strong> نوفر أدوات لضمان سلامتك. احظر المستخدمين الذين لا تريد التفاعل معهم وأبلغ عن أي محتوى ينتهك إرشاداتنا."
          },
          {
            "item": "<strong>حذف البيانات:</strong> لديك الحق في طلب الحذف الكامل لحسابك وجميع البيانات المرتبطة به مباشرة من داخل التطبيق."
          }
        ],
        "privacy_summary": "هذا ملخص. للحصول على التفاصيل الكاملة، نشجعك على قراءة سياسة الخصوصية الكاملة الخاصة بنا.",
        "privacy_btn_text": "عرض سياسة الخصوصية الكاملة",
        "footer_title": "هل أنت مستعد للانضمام إلى الرؤية؟",
        "footer_desc": "نزّل RuyaX اليوم وابدأ رحلتك الإبداعية. لا يسعنا الانتظار لرؤية ما ستبدعه!",
        "download_btn_text": "احصل على RuyaX مجانًا",
        "privacy_page_title": "سياسة الخصوصية - تطبيق RuyaX",
        "privacy_header_title": "سياسة خصوصية تطبيق RuyaX",
        "privacy_header_subtitle": "آخر تحديث: 16 أكتوبر 2025",
        "privacy_content": "### مقدمة\n\nتنطبق سياسة الخصوصية هذه تحديدًا على تطبيق الهاتف المحمول RuyaX (\"التطبيق\"). وهي توضح كيفية جمعنا واستخدامنا وحماية معلوماتك عند استخدامك لتطبيقنا. للحصول على معلومات بخصوص موقعنا الإلكتروني، يرجى الاطلاع على [سياسة خصوصية الموقع الإلكتروني](privacy.html).\n\n### المعلومات التي نجمعها\n\n#### المعلومات التي تقدمها لنا\n*   **معلومات الحساب:** عند إنشاء حساب RuyaX، فإنك تزودنا بمعلومات مثل عنوان بريدك الإلكتروني واسم المستخدم وكلمة المرور. يمكنك أيضًا اختيار إضافة المزيد من المعلومات إلى ملفك الشخصي، مثل صورة الملف الشخصي، والسيرة الذاتية، والعمر، والجنس، والبلد.\n*   **المحتوى:** نقوم بجمع المحتوى الذي تنشئه على التطبيق، بما في ذلك الصور ومقاطع الفيديو التي تحمّلها، والتعليقات التي تنشرها، والبيانات الوصفية المرتبطة بهذا المحتوى.\n*   **الاتصالات:** نقوم بجمع المعلومات عندما تتواصل معنا (على سبيل المثال، لدعم العملاء) أو مع الآخرين من خلال ميزات المراسلة في التطبيق، بما في ذلك محتوى الرسائل والوسائط والملاحظات الصوتية.\n\n#### المعلومات التي نجمعها تلقائيًا\n*   **معلومات الاستخدام:** نقوم بجمع معلومات حول نشاطك على التطبيق، مثل مقاطع الفيديو التي تشاهدها، والمبدعين الذين تتابعهم، وكيفية تفاعلك مع المحتوى والميزات.\n*   **معلومات الجهاز:** نقوم بجمع معلومات من وعن الأجهزة التي تستخدمها، مثل عنوان IP الخاص بك، ونوع الجهاز، ونظام التشغيل، ومعرفات الجهاز الفريدة.\n\n#### الأذونات\n*   **الكاميرا والصور/الفيديو:** نطلب الوصول إلى الكاميرا ومكتبة الصور/الفيديو الخاصة بك حتى تتمكن من إنشاء وتحميل محتوى مرئي، وهي ميزة أساسية في التطبيق.\n*   **الميكروفون:** نطلب الوصول إلى الميكروفون الخاص بك للسماح لك بتسجيل الصوت لمقاطع الفيديو الخاصة بك وإرسال رسائل صوتية في المحادثات.\n\n### كيف نستخدم معلوماتك\n\nنحن نستخدم معلوماتك من أجل:\n\n*   توفير التطبيق وميزاته وصيانتها وتحسينها.\n*   تخصيص تجربتك من خلال عرض محتوى نعتقد أنه سيهمك.\n*   السماح لك بالاتصال والتواصل مع المستخدمين الآخرين.\n*   التواصل معك، بما في ذلك الدعم الفني والإعلانات المتعلقة بالخدمة.\n*   تطبيق شروطنا وشروطنا وسياساتنا لضمان سلامة وأمن مجتمعنا.\n\n### كيف نشارك معلوماتك\n\nقد نشارك معلوماتك في الحالات التالية:\n\n*   **مع المستخدمين الآخرين:** معلومات ملفك الشخصي (اسم المستخدم، صورة الملف الشخصي) والمحتوى الذي تنشره تكون مرئية للمستخدمين الآخرين. يعتمد مدى مشاركة المحتوى الخاص بك على إعدادات جمهورك.\n*   **لأسباب قانونية:** قد نشارك المعلومات إذا كنا نعتقد أنها مطلوبة بموجب القانون أو لحماية حقوق أو ممتلكات أو سلامة RuyaX أو مستخدمينا أو الآخرين.\n\n### خياراتك وتحكمك\n\nلديك السيطرة على معلوماتك. داخل التطبيق، يمكنك:\n\n*   الوصول إلى معلومات ملفك الشخصي وتحديثها في أي وقت.\n*   التحكم في من يمكنه رؤية المحتوى الخاص بك.\n*   حذف حسابك بشكل دائم من خلال قائمة الإعدادات، مما سيؤدي أيضًا إلى حذف بياناتك.\n*   حظر المستخدمين الآخرين والإبلاغ عن المحتوى الذي ينتهك سياساتنا.\n\n### اتصل بنا\n\nإذا كانت لديك أسئلة حول سياسة خصوصية التطبيق هذه، يرجى الاتصال بنا على: <a href='mailto:contact@ruyax.dev'>contact@ruyax.dev</a>"
      },
      "screenshots": [
        {
          "src": "https://raw.githubusercontent.com/AssylEr/MedEr/main/Screenshot1.jpg"
        },
        {
          "src": "https://raw.githubusercontent.com/AssylEr/MedEr/main/Screenshot2.jpg"
        },
        {
          "src": "https://raw.githubusercontent.com/AssylEr/MedEr/main/Screenshot3.jpg"
        },
        {
          "src": "https://raw.githubusercontent.com/AssylEr/MedEr/main/Screenshot4.jpg"
        },
        {
          "src": "https://raw.githubusercontent.com/AssylEr/MedEr/main/Screenshot5.jpg"
        },
        {
          "src": "https://raw.githubusercontent.com/AssylEr/MedEr/main/Screenshot6.jpg"
        },
        {
          "src": "https://raw.githubusercontent.com/AssylEr/MedEr/main/Screenshot7.jpg"
        },
        {
          "src": "https://raw.githubusercontent.com/AssylEr/MedEr/main/Screenshot8.jpg"
        },
        {
          "src": "https://raw.githubusercontent.com/AssylEr/MedEr/main/Screenshot9.jpg"
        },
        {
          "src": "https://raw.githubusercontent.com/AssylEr/MedEr/main/Screenshot10.jpg"
        },
        {
          "src": "https://raw.githubusercontent.com/AssylEr/MedEr/main/Screenshot11.jpg"
        }
      ],
      "download_link": "https://play.google.com/store/apps/details?id=com.appy.ruyax"
    },
    {
      "imgSrc": "1000035949.png",
      "download_link": "",
      "en": {
        "name": "Puzzle games",
        "short_desc": "Challenging puzzles, engaging gameplay, and endless fun await you. Train your brain daily!",
        "intro_desc": "Puzzle games is more than just an app; it's a gateway to improving your cognitive skills while having an absolute blast. From classic jigsaws to innovative logic challenges, our diverse collection promises hours of entertainment for puzzle enthusiasts of all ages.",
        "privacy_content": "This Privacy Policy describes how Puzzle games collects, uses, and discloses information from and about you when you use our mobile application. We are committed to protecting your personal information and your right to privacy. If you have any questions or concerns about our policy or our practices with regard to your personal information, please contact us. Information We Collect: We do not collect any personally identifiable information (PII) from users. We may collect non-personal data such as device information (model, OS version), app usage statistics (features used, time spent), and crash reports to improve app performance and user experience. This data is aggregated and anonymized. How We Use Information: The non-personal data collected is used solely to analyze app performance, identify bugs, and enhance future updates. We do not use this data to identify individual users. Data Security: We implement appropriate technical and organizational security measures designed to protect the security of any personal information we process. However, please remember that we cannot guarantee that the internet itself is 100% secure. Third-Party Services: Our app may contain links to other websites or services not operated by us. We have no control over and assume no responsibility for the content, privacy policies, or practices of any third-party sites or services. Children's Privacy: We do not knowingly solicit data from or market to children under 13 years of age. Changes to This Privacy Policy: We may update our Privacy Policy from time to time. We will notify you of any changes by posting the new Privacy Policy within the app. Contact Us: If you have questions or comments about this policy, you may contact us.",
        "page_title": "Puzzle games - Your Daily Brain Challenge!",
        "header_title": "Unlock Endless Fun & Sharpen Your Mind!",
        "header_subtitle": "Dive into a captivating world of logic, strategy, and pure enjoyment.",
        "intro_title": "Welcome to Your Next Obsession",
        "features_title": "Key Features Designed for You",
        "features_desc": "Discover what makes Puzzle games the ultimate brain-training companion: - **Diverse Puzzle Categories**: Explore jigsaws, sudoku, crosswords, logic grids, and more! - **Daily Challenges**: Keep your mind sharp with fresh, new puzzles every day. - **Intuitive Interface**: Easy to navigate and play, perfect for all skill levels. - **Stunning Graphics & Sound**: Immerse yourself in a beautifully designed gaming experience. - **Offline Play**: Enjoy your favorite puzzles anytime, anywhere, without an internet connection.",
        "gallery_title": "See the Fun in Action",
        "gallery_desc": "A glimpse into the vibrant and challenging world of Puzzle games. Get ready to be captivated!",
        "howto_title": "Master the Art of Puzzling",
        "howto_desc": "Getting started with Puzzle games is simple: 1. **Choose Your Game**: Select from a wide array of puzzle categories. 2. **Pick Your Difficulty**: Start easy or challenge yourself with expert levels. 3. **Drag, Drop, & Solve**: Use intuitive controls to complete puzzles. 4. **Track Your Progress**: See how you improve and conquer new challenges!",
        "privacy_title": "Your Privacy Matters",
        "privacy_desc": "We are committed to protecting your privacy. Learn how we handle your data responsibly.",
        "privacy_summary": "At Puzzle games, we respect your privacy. We collect minimal data, primarily for app functionality and improvement, and never share or sell your personal information to third parties. Your data is secure with us.",
        "privacy_btn_text": "View Privacy Policy",
        "footer_title": "Start Your Puzzle Adventure Today!",
        "footer_desc": "Join millions of players worldwide. Download Puzzle games and challenge your brain!",
        "download_btn_text": "Download Now",
        "privacy_page_title": "Puzzle games - Privacy Policy",
        "privacy_header_title": "Privacy Policy for Puzzle games",
        "privacy_header_subtitle": "Understanding how we protect your personal information.",
        "features_list": [],
        "howto_steps": [],
        "privacy_points": []
      },
      "ar": {
        "name": "لعبة البازل العصرية",
        "short_desc": "ألغاز محيرة، أسلوب لعب ممتع، ومتعة لا حدود لها في انتظارك. درب عقلك يومياً!",
        "intro_desc": "لعبة البازل العصرية هي أكثر من مجرد تطبيق؛ إنها بوابتك لتحسين مهاراتك الإدراكية بينما تستمتع بوقتك إلى أقصى حد. من أحاجي الصور المقطوعة الكلاسيكية إلى تحديات المنطق المبتكرة، تعد مجموعتنا المتنوعة بساعات من الترفيه لعشاق الألغاز من جميع الأعمار.",
        "privacy_content": "تصف سياسة الخصوصية هذه كيفية قيام لعبة البازل العصرية بجمع المعلومات واستخدامها والكشف عنها منك وعنك عند استخدام تطبيقنا المحمول. نحن ملتزمون بحماية معلوماتك الشخصية وحقك في الخصوصية. إذا كانت لديك أي أسئلة أو مخاوف بشأن سياستنا أو ممارساتنا فيما يتعلق بمعلوماتك الشخصية، فيرجى الاتصال بنا. المعلومات التي نجمعها: لا نجمع أي معلومات تعريف شخصية (PII) من المستخدمين. قد نجمع بيانات غير شخصية مثل معلومات الجهاز (النموذج، إصدار نظام التشغيل)، إحصائيات استخدام التطبيق (الميزات المستخدمة، الوقت المستغرق)، وتقارير الأعطال لتحسين أداء التطبيق وتجربة المستخدم. يتم تجميع هذه البيانات وإخفائها. كيف نستخدم المعلومات: تُستخدم البيانات غير الشخصية التي تم جمعها فقط لتحليل أداء التطبيق، وتحديد الأخطاء، وتعزيز التحديثات المستقبلية. لا نستخدم هذه البيانات لتحديد هوية المستخدمين الفرديين. أمان البيانات: نطبق تدابير أمنية تقنية وتنظيمية مناسبة مصممة لحماية أمان أي معلومات شخصية نعالجها. ومع ذلك، يرجى تذكر أننا لا نستطيع ضمان أن الإنترنت نفسه آمن بنسبة 100%. خدمات الطرف الثالث: قد يحتوي تطبيقنا على روابط لمواقع ويب أو خدمات أخرى لا تديرها نحن. ليس لدينا أي سيطرة على محتوى أو سياسات الخصوصية أو ممارسات أي مواقع أو خدمات طرف ثالث ولا نتحمل أي مسؤولية عنها. خصوصية الأطفال: لا نطلب عن علم بيانات من الأطفال دون سن 13 عاماً أو نسوق لهم. تغييرات على سياسة الخصوصية هذه: قد نقوم بتحديث سياسة الخصوصية الخاصة بنا من وقت لآخر. سنعلمك بأي تغييرات عن طريق نشر سياسة الخصوصية الجديدة داخل التطبيق. اتصل بنا: إذا كانت لديك أسئلة أو تعليقات حول هذه السياسة، يمكنك الاتصال بنا.",
        "page_title": "لعبة البازل العصرية - تحدي ذكاء يومي لا مثيل له!",
        "header_title": "أطلق العنان لمتعة لا نهاية لها واشحذ ذهنك!",
        "header_subtitle": "اغمر نفسك في عالم آسر من المنطق، الاستراتيجية، والمتعة المطلقة.",
        "intro_title": "مرحباً بك في إدمانك الجديد",
        "features_title": "ميزات رئيسية صُممت لأجلك",
        "features_desc": "اكتشف ما يجعل لعبة البازل العصرية رفيقك الأمثل لتدريب الدماغ: - **فئات ألغاز متنوعة**: استكشف ألغاز الصور المقطوعة، سودوكو، الكلمات المتقاطعة، شبكات المنطق، والمزيد! - **تحديات يومية**: حافظ على حدة ذهنك بألغاز جديدة ومنعشة كل يوم. - **واجهة سهلة الاستخدام**: سهلة التصفح واللعب، مثالية لجميع مستويات المهارة. - **رسومات وأصوات مذهلة**: اغمر نفسك في تجربة لعب مصممة بجمالية رائعة. - **اللعب دون اتصال**: استمتع بألغازك المفضلة في أي وقت، في أي مكان، دون الحاجة لاتصال بالإنترنت.",
        "gallery_title": "شاهد المتعة في العمل",
        "gallery_desc": "لمحة عن عالم لعبة البازل العصرية النابض بالحياة والتحدي. استعد للانبهار!",
        "howto_title": "أتقن فن حل الألغاز",
        "howto_desc": "البدء مع لعبة البازل العصرية بسيط: 1. **اختر لعبتك**: حدد من مجموعة واسعة من فئات الألغاز. 2. **اختر مستوى الصعوبة**: ابدأ بسهولة أو تحدى نفسك بمستويات الخبراء. 3. **اسحب، أسقط، وحل**: استخدم عناصر التحكم البديهية لإكمال الألغاز. 4. **تتبع تقدمك**: شاهد كيف تتحسن وتتغلب على تحديات جديدة!",
        "privacy_title": "خصوصيتك تهمنا",
        "privacy_desc": "نحن ملتزمون بحماية خصوصيتك. تعرف على كيفية تعاملنا مع بياناتك بمسؤولية.",
        "privacy_summary": "في لعبة البازل العصرية، نحترم خصوصيتك. نجمع الحد الأدنى من البيانات، بشكل أساسي لوظائف التطبيق وتحسينه، ولا نشارك أو نبيع معلوماتك الشخصية لأطراف ثالثة أبداً. بياناتك آمنة معنا.",
        "privacy_btn_text": "عرض سياسة الخصوصية",
        "footer_title": "ابدأ مغامرة الألغاز اليوم!",
        "footer_desc": "انضم إلى ملايين اللاعبين حول العالم. حمل لعبة البازل العصرية وتحدى ذهنك!",
        "download_btn_text": "حمل الآن",
        "privacy_page_title": "لعبة البازل العصرية - سياسة الخصوصية",
        "privacy_header_title": "سياسة الخصوصية للعبة البازل العصرية",
        "privacy_header_subtitle": "فهم كيفية حمايتنا لمعلوماتك الشخصية.",
        "features_list": [],
        "howto_steps": [],
        "privacy_points": []
      },
      "slug": "puzzle-games",
      "is_placeholder": false,
      "alt": "",
      "screenshots": [
        {
          "src": "1000035909.jpg"
        },
        {
          "src": "1000035910.jpg"
        },
        {
          "src": "1000036151.jpg"
        },
        {
          "src": "1000036152.jpg"
        }
      ],
      "href": "app.html?slug=puzzle-games"
    },
    {
      "imgSrc": "1000036084.jpg",
      "download_link": "google.com",
      "en": {
        "name": "Bubble Shooter",
        "short_desc": "Join the fun! Aim, match, and pop colorful bubbles in this exciting puzzle game. Free, addictive, and perfect for all ages!",
        "intro_desc": "Dive into a vibrant world filled with colorful bubbles and exciting challenges! Bubble Shooter offers classic bubble-popping fun with a modern twist. Master your aiming skills, strategize your shots, and clear the board to achieve high scores and unlock new levels. It's easy to learn, yet challenging to master, providing endless hours of entertainment for puzzle lovers of all ages.",
        "privacy_content": "## Bubble Shooter Privacy Policy\n\n**Last Updated:** October 26, 2023\n\nThank you for choosing Bubble Shooter! This Privacy Policy explains how [Your Company Name] (\"we,\" \"us,\" or \"our\") collects, uses, and discloses information about you when you use our mobile application, Bubble Shooter (the \"App\").\n\n**1. Information We Collect**\n\nWe collect information to provide and improve our services to you. The types of information we collect depend on how you use our App.\n\n*   **Non-Personal Information:** When you use the App, we may collect non-personal data such as:\n    *   Device information (e.g., device model, operating system version).\n    *   Game progress, scores, and achievements.\n    *   Usage data (e.g., how often you play, features you interact with, time spent in the App).\n*   **Advertising Identifiers:** We may collect advertising identifiers (such as Android Advertising ID or Apple's Identifier for Advertisers - IDFA) for advertising and analytics purposes.\n*   **Analytics Information:** We use third-party analytics tools (e.g., Google Analytics for Firebase) to help us measure traffic and usage trends for the App. These tools collect information sent by your device, including the web pages you visit, add-ons, and other information that assists us in improving the App. We collect and use this analytics information with analytics information from other users so that it cannot reasonably be used to identify any particular individual user.\n\n**2. How We Use Your Information**\n\nWe use the information we collect for various purposes, including to:\n\n*   Operate, maintain, and improve the App and our services.\n*   Understand and analyze how you use our App and what features are popular.\n*   Develop new products, services, features, and functionality.\n*   Communicate with you, either directly or through one of our partners, for customer service, to provide you with updates and other information relating to the App, and for marketing and promotional purposes.\n*   Find and prevent fraud.\n*   Personalize your experience in the App.\n*   Serve relevant advertisements through third-party ad networks.\n\n**3. How We Share Your Information**\n\nWe will not rent or sell your non-personally identifiable information to third parties outside [Your Company Name] and its group companies (including any parent, subsidiaries, and affiliates) without your consent, except as noted below:\n\n*   **Service Providers:** We may share your information with third-party service providers who perform services on our behalf, such as analytics, hosting, advertising, and customer support.\n*   **Advertising Partners:** We partner with third-party advertising networks to display ads within our App. These partners may collect and use your device identifier and other information to provide you with targeted advertisements that they believe are of most interest to you. This Privacy Policy does not apply to, and we cannot control the activities of, third-party advertisers.\n*   **Compliance with Laws:** We may disclose your information where required to do so by law or subpoena or if we reasonably believe that such action is necessary to (a) comply with the law and the reasonable requests of law enforcement; (b) to protect the security or integrity of our App; and/or (c) to exercise or protect the rights, property, or personal safety of [Your Company Name], our users, or others.\n\n**4. Your Choices About Your Information**\n\n*   **Advertising:** You can opt-out of interest-based advertising on mobile applications by checking the privacy settings of your Android or iOS device and selecting 'Limit Ad Tracking' (Apple iOS) or 'Opt-out of Interest-Based Ads' (Google Android).\n\n**5. Security**\n\nWe care about the security of your information and use commercially reasonable safeguards to preserve the integrity and security of all information collected through the App. However, no security system is impenetrable, and we cannot guarantee the security of our systems 100%.\n\n**6. Children's Privacy**\n\nOur App is not intended for children under 13 years of age, and we do not knowingly collect personal information from children under 13. If you are under 13, please do not use or provide any information on this App or through any of its features. If we learn we have collected or received personal information from a child under 13 without verification of parental consent, we will delete that information. If you believe we might have any information from or about a child under 13, please contact us at [Your Contact Email].\n\n**7. Changes to Our Privacy Policy**\n\nWe may modify or update this Privacy Policy from time to time, so please review it periodically. We may provide you with additional forms of notice of modifications or updates as appropriate. Your continued use of Bubble Shooter after any modification to this Privacy Policy will constitute your acceptance of such modification.\n\n**8. Contact Us**\n\nIf you have any questions about this Privacy Policy, please contact us at [Your Contact Email].",
        "page_title": "Bubble Shooter: Pop & Blast Puzzle Game",
        "header_title": "Bubble Shooter: Your Next Obsession",
        "header_subtitle": "Aim, Match, and Pop Your Way to Victory in this Addictive Puzzle Adventure!",
        "intro_title": "Welcome to the World of Bubble Shooter!",
        "features_title": "Why You'll Love Bubble Shooter",
        "features_desc": "Experience a game designed for ultimate fun and relaxation:\n\n*   **Classic Gameplay:** Enjoy the timeless fun of bubble shooting.\n*   **Hundreds of Levels:** Explore diverse levels with unique layouts and challenges.\n*   **Exciting Boosters:** Unlock powerful boosters and special bubbles to clear difficult stages.\n*   **Stunning Graphics:** Immerse yourself in beautiful visuals and animations.\n*   **Play Offline:** No internet? No problem! Play anytime, anywhere.\n*   **Free to Play:** Download and enjoy for free!",
        "gallery_title": "See the Fun in Action!",
        "gallery_desc": "Get a sneak peek at the captivating gameplay and vibrant levels of Bubble Shooter. Our screenshots showcase the exciting challenges and beautiful design waiting for you.",
        "howto_title": "How to Play Bubble Shooter",
        "howto_desc": "Playing Bubble Shooter is simple and incredibly satisfying:\n\n1.  **Aim Your Shot:** Tap and drag your finger to aim the bubble launcher.\n2.  **Match Colors:** Release to shoot! Match 3 or more bubbles of the same color to pop them.\n3.  **Clear the Board:** Your goal is to clear all bubbles from the screen.\n4.  **Strategize:** Plan your shots to create combos and use fewer bubbles for higher scores.\n5.  **Use Boosters:** Deploy special boosters when you need a little help to clear tricky sections.",
        "privacy_title": "Your Privacy Matters",
        "privacy_desc": "We are committed to protecting your privacy. Learn how Bubble Shooter handles your data.",
        "privacy_summary": "This Privacy Policy explains how Bubble Shooter collects, uses, and discloses information about you when you use our mobile application. We are committed to protecting your privacy and ensuring a safe and enjoyable gaming experience. We collect minimal data, primarily for game functionality, analytics, and advertising, and we do not share your personal information with third parties without your consent.",
        "privacy_btn_text": "Read Privacy Policy",
        "footer_title": "Ready to Pop Some Bubbles?",
        "footer_desc": "Download Bubble Shooter today and start your amazing puzzle adventure! Available on all major app stores.",
        "download_btn_text": "Download Now!",
        "privacy_page_title": "Bubble Shooter Privacy Policy",
        "privacy_header_title": "Privacy Policy for Bubble Shooter",
        "privacy_header_subtitle": "Understanding How We Handle Your Data",
        "features_list": [],
        "howto_steps": [],
        "privacy_points": []
      },
      "ar": {
        "name": "قاذف الفقاعات",
        "short_desc": "انضم للمتعة! صوب، طابق، وفجر الفقاعات الملونة في لعبة الألغاز المشوقة هذه. مجانية، مدمنة، ومثالية لجميع الأعمار!",
        "intro_desc": "اغمر نفسك في عالم نابض بالحياة مليء بالفقاعات الملونة والتحديات المثيرة! تقدم لعبة قاذف الفقاعات متعة تفجير الفقاعات الكلاسيكية بلمسة عصرية. أتقن مهارات التصويب لديك، خطط لطلقاتك بذكاء، وامسح اللوحة لتحقيق أعلى النقاط واكتشاف مستويات جديدة. اللعبة سهلة التعلم، لكنها تتطلب إتقاناً لتحديك، موفرة ساعات لا نهائية من الترفيه لعشاق الألغاز من جميع الأعمار.",
        "privacy_content": "## سياسة خصوصية قاذف الفقاعات\n\n**آخر تحديث:** 26 أكتوبر 2023\n\nنشكرك على اختيار قاذف الفقاعات! توضح سياسة الخصوصية هذه كيف تقوم [اسم شركتك] (\"نحن\"، أو \"لنا\"، أو \"خاصتنا\") بجمع واستخدام والكشف عن المعلومات الخاصة بك عند استخدامك لتطبيق الهاتف المحمول الخاص بنا، قاذف الفقاعات (\"التطبيق\").\n\n**1. المعلومات التي نجمعها**\n\nنقوم بجمع المعلومات لتقديم خدماتنا إليك وتحسينها. تعتمد أنواع المعلومات التي نجمعها على كيفية استخدامك لتطبيقنا.\n\n*   **المعلومات غير الشخصية:** عند استخدامك للتطبيق، قد نجمع بيانات غير شخصية مثل:\n    *   معلومات الجهاز (مثل طراز الجهاز، إصدار نظام التشغيل).\n    *   تقدم اللعبة، النتائج، والإنجازات.\n    *   بيانات الاستخدام (مثل عدد مرات اللعب، الميزات التي تتفاعل معها، الوقت المستغرق في التطبيق).\n*   **معرفات الإعلانات:** قد نجمع معرفات الإعلانات (مثل معرف إعلانات Android أو معرف أبل للمعلنين - IDFA) لأغراض الإعلان والتحليلات.\n*   **معلومات التحليلات:** نستخدم أدوات تحليلات من طرف ثالث (مثل Google Analytics for Firebase) لمساعدتنا في قياس حركة المرور واتجاهات الاستخدام للتطبيق. تجمع هذه الأدوات المعلومات المرسلة من جهازك، بما في ذلك الصفحات التي تزورها، والإضافات، وغيرها من المعلومات التي تساعدنا في تحسين التطبيق. نقوم بجمع واستخدام معلومات التحليلات هذه مع معلومات التحليلات من المستخدمين الآخرين بحيث لا يمكن استخدامها بشكل معقول لتحديد هوية أي مستخدم فردي معين.\n\n**2. كيف نستخدم معلوماتك**\n\nنستخدم المعلومات التي نجمعها لأغراض مختلفة، بما في ذلك:\n\n*   تشغيل التطبيق وخدماتنا وصيانتها وتحسينها.\n*   فهم وتحليل كيفية استخدامك لتطبيقنا والميزات الشائعة.\n*   تطوير منتجات وخدمات وميزات ووظائف جديدة.\n*   التواصل معك، إما مباشرة أو من خلال أحد شركائنا، لخدمة العملاء، لتزويدك بالتحديثات وغيرها من المعلومات المتعلقة بالتطبيق، ولأغراض التسويق والترويج.\n*   اكتشاف ومنع الاحتيال.\n*   تخصيص تجربتك في التطبيق.\n*   عرض إعلانات ذات صلة من خلال شبكات إعلانية تابعة لجهات خارجية.\n\n**3. كيف نشارك معلوماتك**\n\nلن نقوم بتأجير أو بيع معلوماتك غير الشخصية لأطراف ثالثة خارج [اسم شركتك] وشركات مجموعتها (بما في ذلك أي شركة أم أو شركات تابعة أو فروع) دون موافقتك، باستثناء ما هو مذكور أدناه:\n\n*   **مقدمو الخدمات:** قد نشارك معلوماتك مع مقدمي خدمات من طرف ثالث يقدمون خدمات نيابة عنا، مثل التحليلات والاستضافة والإعلان ودعم العملاء.\n*   **شركاء الإعلان:** نحن نتعاون مع شبكات إعلانية من طرف ثالث لعرض الإعلانات داخل تطبيقنا. قد يقوم هؤلاء الشركاء بجمع واستخدام معرف جهازك ومعلومات أخرى لتزويدك بإعلانات مستهدفة يعتقدون أنها الأكثر اهتمامًا لك. لا تنطبق سياسة الخصوصية هذه على أنشطة المعلنين من طرف ثالث، ولا يمكننا التحكم فيها.\n*   **الامتثال للقوانين:** قد نكشف عن معلوماتك حيثما يقتضي القانون أو مذكرة استدعاء أو إذا اعتقدنا بشكل معقول أن مثل هذا الإجراء ضروري لـ (أ) الامتثال للقانون والطلبات المعقولة لإنفاذ القانون؛ (ب) حماية أمن أو سلامة تطبيقنا؛ و/أو (ج) ممارسة أو حماية حقوق أو ممتلكات أو السلامة الشخصية لـ [اسم شركتك] أو مستخدمينا أو الآخرين.\n\n**4. خياراتك بشأن معلوماتك**\n\n*   **الإعلان:** يمكنك إلغاء الاشتراك في الإعلانات القائمة على الاهتمامات على تطبيقات الهاتف المحمول عن طريق التحقق من إعدادات الخصوصية لجهاز Android أو iOS الخاص بك وتحديد 'تحديد تتبع الإعلانات' (Apple iOS) أو 'إلغاء الاشتراك في الإعلانات القائمة على الاهتمامات' (Google Android).\n\n**5. الأمن**\n\nنحن نهتم بأمن معلوماتك ونستخدم ضمانات معقولة تجارياً للحفاظ على سلامة وأمن جميع المعلومات التي يتم جمعها عبر التطبيق. ومع ذلك، لا يوجد نظام أمني منيع، ولا يمكننا ضمان أمن أنظمتنا بنسبة 100%.\n\n**6. خصوصية الأطفال**\n\nتطبيقنا ليس مخصصًا للأطفال دون سن 13 عامًا، ولا نجمع معلومات شخصية عن عمد من الأطفال دون سن 13 عامًا. إذا كنت دون 13 عامًا، فيرجى عدم استخدام هذا التطبيق أو تقديم أي معلومات عليه أو من خلال أي من ميزاته. إذا علمنا أننا جمعنا أو تلقينا معلومات شخصية من طفل دون سن 13 عامًا دون التحقق من موافقة الوالدين، فسنحذف تلك المعلومات. إذا كنت تعتقد أننا قد نكون قد حصلنا على أي معلومات من أو عن طفل دون سن 13 عامًا، فيرجى الاتصال بنا على [بريدك الإلكتروني للاتصال].\n\n**7. التغييرات على سياسة الخصوصية لدينا**\n\nقد نقوم بتعديل أو تحديث سياسة الخصوصية هذه من وقت لآخر، لذا يرجى مراجعتها بشكل دوري. قد نقدم لك أشكالًا إضافية من الإشعارات بالتعديلات أو التحديثات حسب الاقتضاء. سيشكل استمرار استخدامك لقاذف الفقاعات بعد أي تعديل على سياسة الخصوصية هذه موافقتك على هذا التعديل.\n\n**8. اتصل بنا**\n\nإذا كانت لديك أي أسئلة حول سياسة الخصوصية هذه، يرجى الاتصال بنا على [بريدك الإلكتروني للاتصال].",
        "page_title": "قاذف الفقاعات: لعبة الألغاز والتفجير الممتعة",
        "header_title": "قاذف الفقاعات: متعتك القادمة",
        "header_subtitle": "صوب، طابق، وفجر طريقك نحو الفوز في مغامرة الألغاز المدمنة هذه!",
        "intro_title": "أهلاً بك في عالم قاذف الفقاعات!",
        "features_title": "لماذا ستحب قاذف الفقاعات",
        "features_desc": "استمتع بلعبة مصممة للمتعة القصوى والاسترخاء:\n\n*   **أسلوب لعب كلاسيكي:** استمتع بالمتعة الخالدة لتفجير الفقاعات.\n*   **مئات المستويات:** استكشف مستويات متنوعة بتصاميم وتحديات فريدة.\n*   **معززات مثيرة:** افتح معززات قوية وفقاعات خاصة لمساعدتك في المستويات الصعبة.\n*   **رسومات مذهلة:** انغمس في مرئيات ورسوم متحركة جميلة.\n*   **العب دون اتصال:** لا يوجد إنترنت؟ لا مشكلة! العب في أي وقت وأي مكان.\n*   **مجانية اللعب:** حمل اللعبة واستمتع بها مجاناً!",
        "gallery_title": "شاهد المتعة في العمل!",
        "gallery_desc": "ألقِ نظرة خاطفة على أسلوب اللعب الآسر والمستويات النابضة بالحياة في قاذف الفقاعات. تعرض لقطات الشاشة الخاصة بنا التحديات المثيرة والتصميم الجميل الذي ينتظرك.",
        "howto_title": "كيف تلعب قاذف الفقاعات",
        "howto_desc": "لعب قاذف الفقاعات بسيط ومرضٍ للغاية:\n\n1.  **صوب لقطتك:** اضغط واسحب إصبعك لتصويب قاذف الفقاعات.\n2.  **طابق الألوان:** حرر لتطلق! طابق 3 فقاعات أو أكثر من نفس اللون لتفجيرها.\n3.  **امسح اللوحة:** هدفك هو مسح جميع الفقاعات من الشاشة.\n4.  **ضع استراتيجية:** خطط لطلقاتك لإنشاء مجموعات واستخدام عدد أقل من الفقاعات للحصول على درجات أعلى.\n5.  **استخدم المعززات:** انشر المعززات الخاصة عندما تحتاج إلى القليل من المساعدة لإزالة الأقسام الصعبة.",
        "privacy_title": "خصوصيتك تهمنا",
        "privacy_desc": "نحن ملتزمون بحماية خصوصيتك. تعرف على كيفية تعامل قاذف الفقاعات مع بياناتك.",
        "privacy_summary": "توضح سياسة الخصوصية هذه كيفية جمع واستخدام وتخزين المعلومات عنك عند استخدامك لتطبيق قاذف الفقاعات الخاص بنا. نحن ملتزمون بحماية خصوصيتك وضمان تجربة لعب آمنة وممتعة. نقوم بجمع الحد الأدنى من البيانات، بشكل أساسي لوظائف اللعبة والتحليلات والإعلانات، ولا نشارك معلوماتك الشخصية مع أطراف ثالثة دون موافقتك.",
        "privacy_btn_text": "اقرأ سياسة الخصوصية",
        "footer_title": "هل أنت مستعد لتفجير بعض الفقاعات؟",
        "footer_desc": "حمل قاذف الفقاعات اليوم وابدأ مغامرتك اللغزية المذهلة! متوفرة في جميع متاجر التطبيقات الرئيسية.",
        "download_btn_text": "حمل الآن!",
        "privacy_page_title": "سياسة خصوصية قاذف الفقاعات",
        "privacy_header_title": "سياسة الخصوصية لتطبيق قاذف الفقاعات",
        "privacy_header_subtitle": "فهم كيفية تعاملنا مع بياناتك",
        "features_list": [],
        "howto_steps": [],
        "privacy_points": []
      },
      "slug": "bubble-shotter",
      "is_placeholder": false,
      "alt": "",
      "screenshots": [
        {
          "src": "1000036084.jpg"
        },
        {
          "src": "1000036199.jpg"
        }
      ],
      "href": "app.html?slug=bubble-shotter"
    }
  ]
}