
{
  "en": {
    "page_title": "Privacy Policy - RuyaX Universe Website",
    "header_title": "Website Privacy Policy",
    "header_subtitle": "Last Updated: October 16, 2025",
    "intro_title": "Introduction",
    "intro_p1": "Welcome to the RuyaX Universe website. Your privacy is important to us. This Privacy Policy explains how we handle information on this website only. It does not cover our applications, such as the RuyaX app, which have their own separate privacy policies.",
    "data_collection_title": "Information We Collect",
    "data_collection_p1": "Our goal is to be transparent about the data we collect and why. For this website, our data collection is minimal and focused on providing a functional experience.",
    "data_type_title": "Types of Data Collected",
    "data_type_list": "*   **Log Data:** Like most websites, our servers may automatically log standard data provided by your web browser. This data may include your computer's IP address, browser type and version, the pages you visit, the time and date of your visit, and other general, non-personal details.\n*   **Local Storage:** We use your browser's local storage to save your language preference (English or Arabic). This is to ensure you see the website in your chosen language on return visits. This information is stored only on your device and is not transmitted to our servers.",
    "data_personal_title": "Personal Information",
    "data_personal_p1": "We do not collect any personally identifiable information (PII) on this website. You are not required to create an account, log in, or provide details like your name or email address to browse our site.",
    "data_use_title": "How We Use Information",
    "data_use_p1": "We use the collected information for the following purposes:",
    "data_use_list": "*   To improve and optimize your experience on our website.\n*   To remember your preferences, such as language settings.\n*   To understand website traffic and usage patterns to help us improve our site's content and structure.",
    "data_sharing_title": "Information Sharing",
    "data_sharing_p1": "Since we do not collect personal information, we do not have any personal information to share. The non-personal log data may be reviewed by our technical team for maintenance and security purposes but is not shared with third parties.",
    "links_title": "Links to Other Websites",
    "links_p1": "Our website contains links to other websites, such as the Google Play Store. We are not responsible for the privacy practices of these other sites. When you leave our website, we encourage you to read the privacy policy of every website you visit.",
    "security_title": "Security",
    "security_p1": "We are committed to ensuring that your information is secure. While no method of transmission over the Internet is 100% secure, we take reasonable steps to protect the limited data related to our website's operation.",
    "contact_title": "Contact Us",
    "contact_p1": "If you have questions or comments about this Privacy Policy, please contact us at:",
    "contact_email_address": "contact@ruyax.dev"
  },
  "ar": {
    "page_title": "سياسة الخصوصية - موقع RuyaX Universe",
    "header_title": "سياسة خصوصية الموقع الإلكتروني",
    "header_subtitle": "آخر تحديث: 16 أكتوبر 2025",
    "intro_title": "مقدمة",
    "intro_p1": "مرحبًا بكم في موقع RuyaX Universe. خصوصيتكم تهمنا. توضح سياسة الخصوصية هذه كيفية تعاملنا مع المعلومات على هذا الموقع الإلكتروني فقط. لا تغطي هذه السياسة تطبيقاتنا، مثل تطبيق RuyaX، التي لها سياسات خصوصية منفصلة خاصة بها.",
    "data_collection_title": "المعلومات التي نجمعها",
    "data_collection_p1": "هدفنا هو أن نكون شفافين بشأن البيانات التي نجمعها وسبب جمعها. بالنسبة لهذا الموقع، فإن جمعنا للبيانات محدود ويركز على توفير تجربة وظيفية.",
    "data_type_title": "أنواع البيانات التي يتم جمعها",
    "data_type_list": "*   **بيانات السجل:** مثل معظم مواقع الويب، قد تقوم خوادمنا تلقائيًا بتسجيل البيانات القياسية التي يوفرها متصفح الويب الخاص بك. قد تتضمن هذه البيانات عنوان IP لجهاز الكمبيوتر الخاص بك، ونوع المتصفح وإصداره، والصفحات التي تزورها، ووقت وتاريخ زيارتك، وتفاصيل عامة أخرى غير شخصية.\n*   **التخزين المحلي:** نستخدم التخزين المحلي للمتصفح الخاص بك لحفظ تفضيلات اللغة (الإنجليزية أو العربية). هذا لضمان رؤيتك للموقع بلغتك المختارة في الزيارات المستقبلية. يتم تخزين هذه المعلومات على جهازك فقط ولا يتم نقلها إلى خوادمنا.",
    "data_personal_title": "المعلومات الشخصية",
    "data_personal_p1": "نحن لا نجمع أي معلومات تعريف شخصية (PII) على هذا الموقع. لست مطالبًا بإنشاء حساب أو تسجيل الدخول أو تقديم تفاصيل مثل اسمك أو عنوان بريدك الإلكتروني لتصفح موقعنا.",
    "data_use_title": "كيف نستخدم المعلومات",
    "data_use_p1": "نستخدم المعلومات التي تم جمعها للأغراض التالية:",
    "data_use_list": "*   لتحسين وتخصيص تجربتك على موقعنا.\n*   لتذكر تفضيلاتك، مثل إعدادات اللغة.\n*   لفهم حركة المرور على الموقع وأنماط الاستخدام لمساعدتنا في تحسين محتوى وهيكل موقعنا.",
    "data_sharing_title": "مشاركة المعلومات",
    "data_sharing_p1": "نظرًا لأننا لا نجمع معلومات شخصية، فليس لدينا أي معلومات شخصية لمشاركتها. قد يتم مراجعة بيانات السجل غير الشخصية من قبل فريقنا الفني لأغراض الصيانة والأمان ولكن لا يتم مشاركتها مع أطراف ثالثة.",
    "links_title": "روابط لمواقع أخرى",
    "links_p1": "يحتوي موقعنا على روابط لمواقع أخرى، مثل متجر Google Play. نحن لسنا مسؤولين عن ممارسات الخصوصية لهذه المواقع الأخرى. عند مغادرة موقعنا، نشجعك على قراءة سياسة الخصوصية لكل موقع تزوره.",
    "security_title": "الأمان",
    "security_p1": "نحن ملتزمون بضمان أمان معلوماتكم. في حين أنه لا توجد طريقة نقل عبر الإنترنت آمنة 100٪، فإننا نتخذ خطوات معقولة لحماية البيانات المحدودة المتعلقة بتشغيل موقعنا.",
    "contact_title": "اتصل بنا",
    "contact_p1": "إذا كانت لديكم أي أسئلة حول سياسة الخصوصية هذه، يرجى الاتصال بنا على:",
    "contact_email_address": "contact@ruyax.dev"
  }
}